In [1]:
import pandas as pd
import datetime

In [2]:
id_series = pd.Series([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
name_series = pd.Series(['joe', "bob", "jeff", "rick", "Carl", "Sam", "ashley", "jessica", "lexi", "angelica"])
salary_series = pd.Series([12345, 23456, 34567, 45678, 56789, 67890, 78901, 89012, 90123, 11234])
department_series = pd.Series(['engineering', 'comms', 'ops', 'engineering', 'comms', 'ops', 'engineering', 'comms', 'ops', 'engineering'])
employee_start_date = pd.Series([datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23)])
employed_series = pd.Series([True, True, True, True, True, True, True, True, True, True,])

In [3]:
Employees = pd.DataFrame({
    'Names': name_series,
    "Salary": salary_series,
    'Department': department_series,
    'Employee Start Date': employee_start_date,
    'employed': employed_series
})

print(Employees)

      Names  Salary   Department Employee Start Date  employed
0       joe   12345  engineering          2000-03-23      True
1       bob   23456        comms          2000-03-23      True
2      jeff   34567          ops          2000-03-23      True
3      rick   45678  engineering          2000-03-23      True
4      Carl   56789        comms          2000-03-23      True
5       Sam   67890          ops          2000-03-23      True
6    ashley   78901  engineering          2000-03-23      True
7   jessica   89012        comms          2000-03-23      True
8      lexi   90123          ops          2000-03-23      True
9  angelica   11234  engineering          2000-03-23      True

In [7]:
Employees.query('Department == @engineering')

      Names  Salary   Department Employee Start Date  employed
0       joe   12345  engineering          2000-03-23      True
3      rick   45678  engineering          2000-03-23      True
6    ashley   78901  engineering          2000-03-23      True
9  angelica   11234  engineering          2000-03-23      True